import string
import numpy as np
text = """щ  зсдлъэд фцяб  цоцюъбк сня пбь  емйюсцдъ й  цяъцк  йюцсцъб йюмсэъъбжэ яцжмжэ, м й ясыфцк - яьэъъбж цяъцгюмлъбж еямъэдж зця цяъцк исбудк,  ъдйжцюсн ъм юц, аюц цъц зсэъмяьдлмьц ядйнюимж щьмядьчшдщ. эе щйдо гюэо еямъэк юцьчиц ящм яцжм пбьэ лэьбжэ: яцж, фяд  фцйюэъэшм "ицъюэъдъюмьч", ям йюцнвэк сняцж й ъэж юсмиюэс дфцсцщм, еъмждъэюбк йщцэжэ пьэъмжэ.  цйюмьчъцд щйд ьмщиэ, щзьцюч яц ющдсйицк.
юсмиюэс  дфцсцщм  ицфям-юц  зсэъмяьдлмь щцсцъэъы,  э  ъм  щбщдйид  пбьм эецпсмлдъм щцсцъм,  ядслмвмн  щ  иьтщд пьэъ. щйд  ьмщиэ  цоцюъцфц сням  пбьэ жнйъбд, сбпъбд, м зця  ъэжэ едьдъъбд зцящмьб. емяъэд ящдсэ ьмщци щбоцяэьэ ъм цфсцжъбк  ящцс-жцъдюъбк,  ими  дфц  ъмебщмьэ  эеясдщьд.  ъм  ъдж  пбьэ юцлд цяъцгюмлъбд  жнйъбд,  лэщцсбпъбд  э нэаъбд  ьмщиэ,  м зцйсдяэъд--ящыогюмлъбк "жцъдюъбк"  юсмиюэс. щ емяъдк амйюэ ящцсм - сня  ймсмтуди й зцфсдпмжэ э иьмяцщбжэ, иэудщуэжэ зцьаэвмжэ исбй.
цоцюъбк  сня зцьыаэь  йщцд  ъмещмъэд  двд щ  юд  щсдждъм,  ицфям  еядйч смесдудъц пбьц юцсфцщмюч яэачт, зсэъцйэжцк зцяжцйицщъбжэ цоцюъэимжэ.
щздсдяэ  ьмщци, ъм зьцвмяэ, щяцьч  уэсцицфц юсцюымсм, йюцньэ здсдъцйъбд змьмюиэ   э   юцьзэьэйч   юцсфцщшб  й  ицсеэъмжэ  э   ждуимжэ,  ъмзцьъдъъбжэ щйдщцежцлъбжэ  зсцяыиюмжэ.  оцяэьэ цоцюъэиэ,  цпщдумъъбд  ыюимжэ, юдюдсимжэ, емкшмжэ. ы пмп эе ицсеэъ юцсамьэ фцьцщб иыс э шбзьню, щ ждуимо щэелмьэ зцсцйнюм,  ицюцсбо зсцямщшб, щбъэжмн эе ждуим,аюцпб  зцимемюч  зциызмюдьт,  ъдзсдждъъц зцяъэжмьэ  ъмя  фцьцщцк,  ядслм ем йщнемъъбд  емяъэд  ъцфэ.  ъм  жцйюцщцк  здсдя  змьмюимжэ  йъцщмьэ зэсцлъэиэ, пьэъъэиэ,  юцсфцщшб фсдаъдщэимжэ,  лмсдъъбжэ  ъм зцйюъцж  жмйьд. йпэюдъвэиэ смеьэщмьэ, зц ицздкид ем  йюмимъ,  фцснаэк йпэюдъч - ьтпэжбк  юцфям ждяцщбк
ъмзэюци, йцфсдщмщуэк эещцеаэицщ э йьылмвэо,  емждсемщуэо щ оцьцяъбо  ьмщимо. ьдюцж  йпэюдъвэицщ  йждъньэ юцсфцщшб  ищмймжэ, э  ймжбк  ьтпэжбк эе ъэо  пбь фсыудщбк, эе  щмсдъбо  фсыу,  ицюцсбд  щ  жцадъцж  щэяд ьдлмьэ  яьн  зсцямлэ зэсмжэямжэ ъм ьцюимо, м ищмй адсзмьэ эе щдясм исылимжэ. жнйъбд э сбпъбд ьмщиэ йцйюцньэ эе  ящыо цюядьдъэк. щ  здсщцж ьдлмьц ъм зцьимо жнйц смеъбо йцсюцщ - яэач, иысб, фыйэ, эъядкиэ, змьдъбд зцсцйнюм яьн лмсицфц  э щ ьдянъбо  щмъъмо - пдьбд зцсцйнюм  яьн емьэщъцфц.  ъм истачно  зц йюдъмж пбьэ смещдумъб юыуэ пмсмуицщ э  зцдъъбо жцьцицж юдьню, м щдйч зцюцьци емъню  цицсцимжэ  щйдщцежцлъбо смеждсцщ э  зсэфцюцщьдъэк--ицзадъбо, щмсдъбо, зсцщдйъбо. щц щюцсцж  цюядьдъээ, юджъцж,  цйщдвдъъцж юцьчиц ящдсчт  щц ящцс, щэйдьэ ядйнюиэ жнйъбо  юыу. зця щйджэ ьмщимжэ -- зцящмьб. цоцюъбк  сня пбщмь цйцпдъъц  цлэщьдъъбж  здсдя  пцьчуэжэ  зсмеяъэимжэ.  и ьмщимж  зцяхделмьэ ъм юбйнаъбо сбймимо смйрсмъадъъбд иызаэоэ, э ем ъэжэ йьылмвэд щбъцйэьэ эе ьмщци"""
# text = "щ  зсдлъэд фцяб  цоцюъбк сня пбь  емйюсцдъ й  цяъцк щ щ щщ уу аа фф яяя ммм "

new_text = text.strip().replace('  ', ' ').split(' ')
print(new_text)

def n_grams(text, n):
    d = {}
    count = 0
    for elem in text:
        if len(elem) == n and elem.isalpha():
            if d.get(elem):
                d[elem] += 1
            else:
                d[elem] = 1
    return dict(reversed(sorted(d.items(), key=lambda x:x[1])))

one = n_grams(new_text, 1)  
two = n_grams(new_text, 2)
three = n_grams(new_text, 3)
print(one)
print(two)
print(three)

global_dict = {
    'э' : 'и',
    'е' : 'з',
    'м' : 'а',
    'ъ' : 'н',
    'и' : 'к', # иАи - КАК
    # 'п' : 'к',
    # 'щ' : 'о',
    # 'й' : 'с',
    
    'я' : 'д',
    'д' : 'е',
    'ж' : 'м',
    'у' : 'ш',
    'ц' : 'о',
    'ь' : 'л',
    'с' : 'р',
    'з' : 'п',
    'л' : 'ж',
    'н' : 'я',
    'в' : 'щ',
    'б' : 'ы',
    'й' : 'с', # ?
    'п' : 'б',
    'ю' : 'т',
    'к' : 'й',
    'щ' : 'в',
    'а' : 'ч',
    'ы' : 'у',
    'ф' : 'г',
    'ы' : 'у',
    'ш' : 'ц',
    'о' : 'х',
    'г' : 'э',
    'ч' : 'ь',
    'т' : 'ю',
    'х' : 'ъ',
    'р' : 'ф',
}
# ЗАДНдк ЗАДНИд  д - е?
# НА  НЕж на нем?
# МЕуКАМИ - мешками?
# ДцМА - Дома
# МОьОКОМ - молоком
# ИЗ КОсЗИН - из корзин
# зРИНАДЛЕлАЛО  - принадлежало
# ЛЕЖАЛИ  ДЛн  ПРОДАЖИ ПИРАМИДАМИ -  ДЛн - для
# ПЛОвАДИ - площади
# ДЛИННбМ - длинным 
# йМЕНЯЛИ - сменяли?
# пбЛ  - пЫЛ - был
# СюОРОНЫ  - стороны
# ОДНОк   - одной
# аТО - что
# ы БАБ ИЗ КОРЗИН ТОРЧАЛИ фОЛОВЫ КыР И шЫПЛЯТ  СЛУЖАЩИо,  ЗАМЕРЗАВШИо ДЛИННЫМ ОДНОгТАЖНЫМ ЗДАНИЕМ 

res_text = ''
for sym in text:
    if global_dict.get(sym):
        res_text += str(global_dict[sym]).upper()
    else:
        res_text += sym

print(str(res_text))